{
  "posts": [
    {
      "author": "Hithesh",
      "title": "Red Pasta",
      "content": "1. Heat 4 cups of water together with ½ teaspoon salt in a pot. Bring the water to a boil.2. Then add 2 cups fusilli pasta (175 grams). You can add penne, rigatoni, ziti, shell or macaroni pasta instead.3. On a medium to high heat, cook until the pasta is al dente or cook it completely, based on your preference.4. In a colander, drain the pasta and set aside",
      "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/chorizo-mozarella-gnocchi-bake-cropped-9ab73a3.jpg?quality=90&resize=556,505",
      "id": 1
    },
    {
      "author": "Darshan",
      "title": "Biryani",
      "content": "Once you have your chicken marinated, rice and fried onions ready, start by cooking the marinated chicken. To cook the chicken, place it in the dutch oven or a large pot that you plan to use for cooking the biryani, and cook them for 7 minutes. There is no need to stir the chicken, only flip it once around the 4 minute mark.\nOnce the chicken is partially cooked, the next step is to layer it with the fried onions, mint and coriander. The onions add sweetness and richness while the herbs add a ton of flavor and freshness. \n\nThe final step is layering with 70% cooked basmati rice. Sprinkle saffron milk and ghee on top and cover tightly with a lid. Originally, the pot was sealed with dough to prevent steam from escaping, but a tight lid works just as well. It's important to cook this on a low flame so that the heat distributes evenly and the bottom doesn't get burnt.\nAnd there you go! The whole thing takes approximately an hour so I call this a weekend project, but after you've done it once, you'll realize how easy and simple making biryani at home is! The results of your labour will look like this, and trust me, there is nothing like the smell of chicken biryani wafting through the house to get everyone to the table!\nLet's just say - five attempts to make sure I provide you with instructions that you can actually follow with ease at home did not seem like work.",
      "image": "https://akm-img-a-in.tosshub.com/sites/rd/resources/202002/biriyani1_1581510894_1200x675.png",
      "id": 2
    }
  ]
}